{
    "cover_letters": [
      {
        "company": "TetraScience",
        "content": "Dear Hiring Manager,\n\nI am excited to apply for the Senior Software Engineer position at TetraScience. With over 10 years of experience in full-stack development, including 7+ years of proficiency in Python and TypeScript, along with extensive experience in AWS and large-scale data systems, I am confident that I can bring a strong technical perspective to your innovative team.\n\nAt Sano Genetics, I’ve contributed to projects that utilize AI-driven solutions to improve data integration and analysis. These experiences have given me insight into developing scalable, user-focused tools and have fueled my passion for creating impactful software that supports scientific and data-driven initiatives.\n\nI’m particularly drawn to TetraScience’s mission to advance scientific discovery through data and AI, and I’m eager to contribute to the development of ML infrastructure and Generative AI applications. The chance to work on cutting-edge technology that directly supports scientific research is exactly the kind of challenge that motivates me.\n\nI would welcome the opportunity to discuss how my skills and experience align with the goals of your team and how I can contribute to TetraScience’s continued success.\n\nThank you for considering my application. I look forward to the possibility of speaking with you soon.\n\nBest regards,\n[Your Name]"
      },
      {
        "company": "Cohere",
        "content": "Dear Hiring Manager,\n\nI am excited to apply for the Software Engineer position at Cohere. With extensive experience in Python and backend development, I have built and shipped fast, reliable web applications that users love. I am particularly drawn to Cohere’s mission of making advanced language models accessible to all, and I am eager to contribute to this goal by developing robust, scalable services and APIs.\n\nIn my current role at Sano Genetics, I have developed AI-driven solutions, such as a custom ChatGPT/OpenAI tool to assist in data research, and built REST APIs to support seamless data integration across complex infrastructures. At Made Tech, I led the backend development of critical public services like the Gov.UK Housing Repairs and Hackney Social Care platforms, delivering high-performance APIs and enhancing overall system reliability.\n\nCohere’s growth and innovation in NLP technology are inspiring, and I would love the opportunity to bring my technical skills to your team.\n\nThank you for considering my application. I look forward to the possibility of discussing how I can contribute to Cohere’s success.\n\nBest regards,\n[Your Name]"
      },
      {
        "company": "LabGenius",
        "content": "Dear Hiring Manager,\n\nI'm excited to apply for the Software Engineer position at LabGenius. With 10 years of experience in software engineering, working with technologies like Python, React, PostgreSQL, AWS, and Docker, I've collaborated closely with bioengineers at Sano Genetics to introduce clean code practices, automate workflows, and optimize genetic pipelines, making their work more efficient and impactful.\n\nMy experience includes refactoring scripts, improving data flow, and automating lab result processing and genetic document approvals. I’ve worked with tools like Sequera Tower and contributed to open-source projects, deploying them with Docker for seamless integration into workflows. Additionally, I’ve built internal tools using OpenAI APIs to support data research, making it easier for teams to work efficiently.\n\nI’m passionate about combining tech and biotech to drive discoveries in human health, and I'd love to bring my skills to your team.\n\nThank you for considering my application. I look forward to discussing how I can support LabGenius's continued success.\n\nBest regards,\nJack"
      }
    ]
  }
  